app/controllers/posts_controller.rb

INSERT INTO "posts" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if @post = Post.create(post_params)